20250903T083109--kdoc-456-ipにパケットの到達性の保証がないのはなぜか__permanent.org
:properties:
:ID: 20250903T083109
:mtime:    20250904002855
:ctime:    20250903083113
:end:
#+title:      KDOC 456: IPにパケットの到達性の保証がないのはなぜか?
#+date:       [2025-09-03 Wed 08:31]
#+filetags:   :permanent:
#+identifier: 20250903T083109

* この文書のステータス
- 作成
  - [X] 2025-10-23 貴島
- レビュー
  - [X] 2025-11-03 貴島

* 概要

[[id:20250903T082941][KDOC 455: 『基礎からわかるTCP/IPネットワークコンピューティング入門』]]176ページから。

- 電話網や郵便網は内部で問題が発生しないように努力している。単に届くだけでなく、ミスが出ないように努力している
- TCP/IPではネットワーク全体を管理する機能は作らなかった。それぞれの組織がネットワークの運用や構築をする、とした
- パケットが届いた保証はネットワーク外ですることにした。TCPは実際に通信している両端のコンピュータで働く
- TCPはネットワークには信頼性がないものと考えて、データの到達性を保証する

IPパケットの到達性の保証がない理由について以上のようにあるが、あまり端的でなく見える。以下、考えたことを書く。

インターネット層(IP)までは、ハードウェアが密接に関係している。機器の価格ひいては方式の普及に影響する。ハードウェアはなるべくシンプルにするため、IPより上の論理的な層で通信の保証をさせることにしたのではないか。

* 関連

- [[id:20250903T082941][KDOC 455: 『基礎からわかるTCP/IPネットワークコンピューティング入門』]]から
