20250903T083109--kdoc-456-ipにパケットの到達性の保証がないのはなぜか__permanent.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-27T23:18:56Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 456: IPにパケットの到達性の保証がないのはなぜか?</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 456: IPにパケットの到達性の保証がないのはなぜか?</h1>
<div id="outline-container-org2e0ea40" class="outline-2">
<h2 id="org2e0ea40"><a href="#org2e0ea40">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org2e0ea40">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-10-23 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-11-03 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgf4a117c" class="outline-2">
<h2 id="orgf4a117c"><a href="#orgf4a117c">概要</a></h2>
<div class="outline-text-2" id="text-orgf4a117c">
<p>
<a href="20250903T082941--kdoc-455-『基礎からわかるtcpipネットワークコンピューティング入門』__permanent.html#ID-20250903T082941">KDOC 455: 『基礎からわかるTCP/IPネットワークコンピューティング入門』</a>176ページから。
</p>

<ul class="org-ul">
<li>電話網や郵便網は内部で問題が発生しないように努力している。単に届くだけでなく、ミスが出ないように努力している</li>
<li>TCP/IPではネットワーク全体を管理する機能は作らなかった。それぞれの組織がネットワークの運用や構築をする、とした</li>
<li>パケットが届いた保証はネットワーク外ですることにした。TCPは実際に通信している両端のコンピュータで働く</li>
<li>TCPはネットワークには信頼性がないものと考えて、データの到達性を保証する</li>
</ul>

<p>
IPパケットの到達性の保証がない理由について以上のようにあるが、あまり端的でなく見える。以下、考えたことを書く。
</p>

<p>
インターネット層(IP)までは、ハードウェアが密接に関係している。機器の価格ひいては方式の普及に影響する。ハードウェアはなるべくシンプルにするため、IPより上の論理的な層で通信の保証をさせることにしたのではないか。
</p>
</div>
</div>
<div id="outline-container-org7544322" class="outline-2">
<h2 id="org7544322"><a href="#org7544322">関連</a></h2>
<div class="outline-text-2" id="text-org7544322">
<ul class="org-ul">
<li><a href="20250903T082941--kdoc-455-『基礎からわかるtcpipネットワークコンピューティング入門』__permanent.html#ID-20250903T082941">KDOC 455: 『基礎からわかるTCP/IPネットワークコンピューティング入門』</a>から</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
